modules/testsuite/native-tests/src/test/resources/benchmark/jmeter/rpclit/req1.xml

<env:Envelope xmlns:env='http://schemas.xmlsoap.org/soap/envelope/'>
    <env:Header/>
    <env:Body>
        <ns1:echoSimpleType xmlns:ns1='http://org.jboss.ws/benchmark'>
            <SimpleUserType_1 xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
                <f>1.0</f>
                <i>1</i>
                <s>test</s>
            </SimpleUserType_1>
        </ns1:echoSimpleType>
    </env:Body>
</env:Envelope>